blueberrygarden/Adaptive-Sensorelektronik/Task 6/Wetterstation/Design01.cydsn/Generated_Source/PSoC5/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.2
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2018 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "Temperatursensor_aliases.h"
#include "Temperatursensor.h"
#include "PGA_1.h"
#include "ADC_1.h"
#include "Discharge_aliases.h"
#include "Discharge.h"
#include "Compare_aliases.h"
#include "Compare.h"
#include "Threshold_1.h"
#include "Trigger_1.h"
#include "Comp_1.h"
#include "Comp_2.h"
#include "Clock_1.h"
#include "PWM_1.h"
#include "Clock_2.h"
#include "isr_1.h"
#include "VDAC_1.h"
#include "PGA_2.h"
#include "Counter_1.h"
#include "Drucksensor_aliases.h"
#include "Drucksensor.h"
#include "ADC_2.h"
#include "UART_1.h"
#include "ADC_1_IRQ.h"
#include "ADC_1_theACLK.h"
#include "ADC_2_IRQ.h"
#include "ADC_2_theACLK.h"
#include "UART_1_IntClock.h"
#include "core_cm3_psoc5.h"
#include "CyDmac.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cypins.h"
#include "cyPm.h"
#include "CySpc.h"
#include "cytypes.h"
#include "cy_em_eeprom.h"

/*[]*/

